In [3]:
import pandas as pd
from fuzzywuzzy import process

In [6]:
df_cities = pd.read_csv("C:/Users/nagap/Documents/Citynames.csv",encoding = 'latin1')

In [12]:
df_cities['Ship_city'] = df_cities['Ship_city'].str.strip().str.title()

In [14]:
df_cities.head()

     Ship_city  Ship_postal_code
0       Mumbai            400081
1    Bengaluru            560085
2  Navi Mumbai            410210
3   Puducherry            605008
4      Chennai            600073

In [17]:
df_local = pd.read_csv("C:/Users/nagap/Downloads/pincode.csv", encoding = "latin1")

In [19]:
df_local.head()

  DivisionName  Pincode       StateName
0    Hindupur    515631  ANDHRA PRADESH
1    Hindupur    515631  ANDHRA PRADESH
2    Hindupur    515631  ANDHRA PRADESH
3    Hindupur    515581  ANDHRA PRADESH
4    Hindupur    515581  ANDHRA PRADESH

In [25]:
df_local['DivisionName'] = df_local['DivisionName'].str.strip().str.title()

In [27]:
df_local.head()

  DivisionName  Pincode       StateName
0     Hindupur   515631  ANDHRA PRADESH
1     Hindupur   515631  ANDHRA PRADESH
2     Hindupur   515631  ANDHRA PRADESH
3     Hindupur   515581  ANDHRA PRADESH
4     Hindupur   515581  ANDHRA PRADESH

In [39]:
def find_matching_division(postal_code):
    local_matches = df_local[df_local['Pincode'] == postal_code]
    if local_matches.empty:
        return None
    return local_matches.iloc[0]['DivisionName']

In [41]:
df_cities['Validated_City'] = df_cities['Ship_city']

In [43]:
df_cities.head()

     Ship_city  Ship_postal_code Validated_City
0       Mumbai            400081         Mumbai
1    Bengaluru            560085      Bengaluru
2  Navi Mumbai            410210    Navi Mumbai
3   Puducherry            605008     Puducherry
4      Chennai            600073        Chennai

In [45]:
##Iterating over each record in df_cities and updating
for index, row in df_cities.iterrows():
    postal_code = row['Ship_postal_code']
    matched_division = find_matching_division(postal_code)
    if matched_division:
        df_cities.at[index,'Validated_City'] = matched_division
    else:
        df_cities.at[index, 'Validated_City'] = row['Ship_city']

In [47]:
print(df_cities)

          Ship_city  Ship_postal_code          Validated_City
0            Mumbai            400081  Mumbai City North East
1         Bengaluru            560085         Bengaluru South
2       Navi Mumbai            410210             Navi Mumbai
3        Puducherry            605008             Pondicherry
4           Chennai            600073                Tambaram
...             ...               ...                     ...
128971    Hyderabad            500013    Hyderabad South East
128972     Gurugram            122004                 Gurgaon
128973    Hyderabad            500049            Secunderabad
128974        Halol            389350             Panchmahals
128975       Raipur            492014                  Raipur

[128976 rows x 3 columns]

In [50]:
df_cities.to_csv('C:/Users/nagap/Documents/ValidatedCities2.csv', index = False)